tests/Chisel.Tests/ChiseledAppTests.RunTestApp_non-windows.verified.mermaid
%% Generated by https://github.com/0xced/Chisel

graph LR

classDef default fill:aquamarine,stroke:#009061,color:#333333
classDef removed fill:lightcoral,stroke:#A42A2A

Azure.Core/1.35.0 --> Microsoft.Bcl.AsyncInterfaces/1.1.1
Azure.Core/1.35.0 --> System.Diagnostics.DiagnosticSource/6.0.1
Azure.Core/1.35.0 --> System.Memory.Data/1.0.2
Azure.Core/1.35.0 --> System.Text.Encodings.Web/8.0.0
Azure.Core/1.35.0 --> System.Text.Json/8.0.0
Azure.Identity/1.10.3 --> Azure.Core/1.35.0
Azure.Identity/1.10.3 --> Microsoft.Identity.Client/4.56.0
Azure.Identity/1.10.3 --> Microsoft.Identity.Client.Extensions.Msal/4.56.0
Azure.Identity/1.10.3 --> System.Security.Cryptography.ProtectedData/8.0.0
Azure.Identity/1.10.3 --> System.Text.Json/8.0.0
Microsoft.Data.SqlClient/5.2.0 --> Azure.Identity/1.10.3
Microsoft.Data.SqlClient/5.2.0 --> Microsoft.Identity.Client/4.56.0
Microsoft.Data.SqlClient/5.2.0 --> Microsoft.IdentityModel.JsonWebTokens/6.35.0
Microsoft.Data.SqlClient/5.2.0 --> Microsoft.IdentityModel.Protocols.OpenIdConnect/6.35.0
Microsoft.Data.SqlClient/5.2.0 --> Microsoft.SqlServer.Server/1.0.0
Microsoft.Data.SqlClient/5.2.0 --> System.Configuration.ConfigurationManager/8.0.0
Microsoft.Data.SqlClient/5.2.0 --> System.Runtime.Caching/8.0.0
Microsoft.Extensions.DependencyModel/8.0.0 --> System.Text.Encodings.Web/8.0.0
Microsoft.Extensions.DependencyModel/8.0.0 --> System.Text.Json/8.0.0
Microsoft.Identity.Client/4.56.0 --> Microsoft.IdentityModel.Abstractions/6.35.0
Microsoft.Identity.Client.Extensions.Msal/4.56.0 --> Microsoft.Identity.Client/4.56.0
Microsoft.Identity.Client.Extensions.Msal/4.56.0 --> System.IO.FileSystem.AccessControl/5.0.0
Microsoft.Identity.Client.Extensions.Msal/4.56.0 --> System.Security.Cryptography.ProtectedData/8.0.0
Microsoft.IdentityModel.JsonWebTokens/6.35.0 --> Microsoft.IdentityModel.Tokens/6.35.0
Microsoft.IdentityModel.JsonWebTokens/6.35.0 --> System.Text.Encodings.Web/8.0.0
Microsoft.IdentityModel.JsonWebTokens/6.35.0 --> System.Text.Json/8.0.0
Microsoft.IdentityModel.Logging/6.35.0 --> Microsoft.IdentityModel.Abstractions/6.35.0
Microsoft.IdentityModel.Protocols/6.35.0 --> Microsoft.IdentityModel.Logging/6.35.0
Microsoft.IdentityModel.Protocols/6.35.0 --> Microsoft.IdentityModel.Tokens/6.35.0
Microsoft.IdentityModel.Protocols.OpenIdConnect/6.35.0 --> Microsoft.IdentityModel.Protocols/6.35.0
Microsoft.IdentityModel.Protocols.OpenIdConnect/6.35.0 --> System.IdentityModel.Tokens.Jwt/6.35.0
Microsoft.IdentityModel.Tokens/6.35.0 --> Microsoft.IdentityModel.Logging/6.35.0
Microsoft.IdentityModel.Tokens/6.35.0 --> System.Security.Cryptography.Cng/4.5.0
System.Configuration.ConfigurationManager/8.0.0 --> System.Diagnostics.EventLog/8.0.0
System.Configuration.ConfigurationManager/8.0.0 --> System.Security.Cryptography.ProtectedData/8.0.0
System.Diagnostics.DiagnosticSource/6.0.1 --> System.Runtime.CompilerServices.Unsafe/6.0.0
System.IdentityModel.Tokens.Jwt/6.35.0 --> Microsoft.IdentityModel.JsonWebTokens/6.35.0
System.IdentityModel.Tokens.Jwt/6.35.0 --> Microsoft.IdentityModel.Tokens/6.35.0
System.IO.FileSystem.AccessControl/5.0.0 --> System.Security.AccessControl/5.0.0
System.IO.FileSystem.AccessControl/5.0.0 --> System.Security.Principal.Windows/5.0.0
System.Memory.Data/1.0.2 --> System.Text.Encodings.Web/8.0.0
System.Memory.Data/1.0.2 --> System.Text.Json/8.0.0
System.Runtime.Caching/8.0.0 --> System.Configuration.ConfigurationManager/8.0.0
System.Security.AccessControl/5.0.0 --> System.Security.Principal.Windows/5.0.0
System.Text.Json/8.0.0 --> System.Text.Encodings.Web/8.0.0

class Azure.Core/1.35.0 removed
class Azure.Identity/1.10.3 removed
class Microsoft.Bcl.AsyncInterfaces/1.1.1 removed
class Microsoft.Data.SqlClient/5.2.0 default
class Microsoft.Extensions.DependencyModel/8.0.0 default
class Microsoft.Identity.Client/4.56.0 default
class Microsoft.Identity.Client.Extensions.Msal/4.56.0 removed
class Microsoft.IdentityModel.Abstractions/6.35.0 default
class Microsoft.IdentityModel.JsonWebTokens/6.35.0 removed
class Microsoft.IdentityModel.Logging/6.35.0 removed
class Microsoft.IdentityModel.Protocols/6.35.0 removed
class Microsoft.IdentityModel.Protocols.OpenIdConnect/6.35.0 removed
class Microsoft.IdentityModel.Tokens/6.35.0 removed
class Microsoft.SqlServer.Server/1.0.0 default
class System.Configuration.ConfigurationManager/8.0.0 default
class System.Diagnostics.DiagnosticSource/6.0.1 removed
class System.Diagnostics.EventLog/8.0.0 default
class System.IdentityModel.Tokens.Jwt/6.35.0 removed
class System.IO.FileSystem.AccessControl/5.0.0 removed
class System.Memory.Data/1.0.2 removed
class System.Runtime.Caching/8.0.0 default
class System.Runtime.CompilerServices.Unsafe/6.0.0 removed
class System.Security.AccessControl/5.0.0 removed
class System.Security.Cryptography.Cng/4.5.0 removed
class System.Security.Cryptography.ProtectedData/8.0.0 default
class System.Security.Principal.Windows/5.0.0 removed
class System.Text.Encodings.Web/8.0.0 default
class System.Text.Json/8.0.0 default
